Revit 2026 API

# WallGetWrappingLocationAsReferences Method

---

Gets an array of references to faces at the location.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Reference> GetWrappingLocationAsReferences(
	int locationIndex
)
```
```vb
Public Function GetWrappingLocationAsReferences (
	locationIndex As Integer
) As IList(Of Reference)
```
```cpp
public:
IList<Reference^>^ GetWrappingLocationAsReferences(
	int locationIndex
)
```
```fsharp
member GetWrappingLocationAsReferences :
        locationIndex : int -> IList<Reference>
```

#### Parameters

locationIndex Int32
     0 or 1 represents wall's end, other number represents the wrapping locations on vertical faces of openings or profiles.

#### Return Value

IListReference All faces' references at the location.

| Exception | Condition |
| --- | --- |
| ArgumentException | This location is invalid for wrapping. |

If the location is invalid, for example: wall doesn't have this location or the location is joined, this function throws ArgumentException. This function may return not only one face, for example: after editing profile, some aligned vertical faces have same location on curve.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace